tutorials/electrochemistry/NTGKPlusAir/constant/batteryRegion/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// Density - Dimensions: kg/m3
rho             rho [1 -3 0 0 0 0 0] 2272.4;

// Specific heat - Dimensions: J/kg-K
cp              cp  [0 2 -2 -1 0 0 0] 867.89;

// Thermal conductivity - Dimensions: W/m-K
k                   k [1 1 -3 -1 0 0 0] 26.71;

// electric conductivity positive electrode - Dimensions: S/m
sigmaPos            sigmaPos [-1 -3 3 0 0 2 0] 4.93e6;

// electric conductivity negative electrode - Dimensions: S/m
sigmaNeg            sigmaNeg [-1 -3 3 0 0 2 0] 4.207e6;



// ************************************************************************* //
