tutorials/electrochemistry/NTGKPlusAir/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

applicationClass    multiRegionFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             1200; // 0.3h

deltaT              1; //10;

writeControl        runTime;

writeInterval       10; //60;

cycleWrite          0;

writeFormat         ascii;

writePrecision      16;

writeCompression    off;

timeFormat          general;

timePrecision       12;

runTimeModifiable   yes;

adjustTimeStep      no;

// ************************************************************************* //
